; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v7 ?v12)
             (pred_9 ?v10 ?v2)
             (pred_4 ?v7 ?v2)
             (pred_1 ?v8 ?v7 )
	     (pred_11 ?v7)
             (pred_10 ?v11)
             (pred_6 ?v10)
             (pred_12 ?v2)
             (pred_2 ?v7)
             (pred_5 ?v10)
             (pred_7 ?v7)
             (pred_8 ))



(:action op_5
:parameters (?v6 ?v1 ?v4 ?v5)
:precondition (and (pred_10 ?v6) (pred_10 ?v1) (pred_6 ?v4) (pred_12 ?v5)
          (pred_3 ?v6 ?v1) (pred_9 ?v4 ?v5)
                   (pred_4 ?v1 ?v5) (pred_11 ?v6) 
                   (pred_2 ?v1) (pred_5 ?v4))
:effect (and  (pred_7 ?v1) (not (pred_2 ?v1))))


(:action op_4
:parameters (?v6 ?v3)
:precondition (and (pred_10 ?v6) (pred_10 ?v3)
               (pred_11 ?v6) (pred_3 ?v6 ?v3) (pred_7 ?v3))
:effect (and (pred_11 ?v3) (not (pred_11 ?v6))))

(:action op_3
:parameters (?v6 ?v4)
:precondition (and (pred_10 ?v6) (pred_6 ?v4) 
                  (pred_11 ?v6) (pred_1 ?v4 ?v6) (pred_8 ))
:effect (and (pred_5 ?v4)
   (not (pred_1 ?v4 ?v6)) (not (pred_8 ))))


(:action op_1
:parameters (?v6 ?v9 ?v13)
:precondition (and (pred_10 ?v6) (pred_6 ?v9) (pred_6 ?v13)
                  (pred_11 ?v6) (pred_5 ?v13) (pred_1 ?v9 ?v6))
:effect (and (pred_5 ?v9) (pred_1 ?v13 ?v6)
        (not (pred_5 ?v13)) (not (pred_1 ?v9 ?v6))))

(:action op_2
:parameters (?v6 ?v4)
:precondition (and (pred_10 ?v6) (pred_6 ?v4) 
                  (pred_11 ?v6) (pred_5 ?v4))
:effect (and (pred_8 ) (pred_1 ?v4 ?v6) (not (pred_5 ?v4)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_18 obj_03 obj_24 obj_28 obj_10 obj_11 obj_02 obj_30 obj_29 obj_07 obj_26 obj_17 obj_19 obj_05 obj_09 obj_13 obj_04 obj_22 obj_08 obj_23 obj_15 obj_20 obj_12 obj_14 obj_06
    obj_27 obj_01
    obj_16 obj_25 obj_21
    )

    (:init
       (pred_8)

       (pred_10 obj_18)
       (pred_10 obj_03)
       (pred_10 obj_24)
       (pred_10 obj_28)
       (pred_10 obj_10)
       (pred_10 obj_11)
       (pred_10 obj_02)
       (pred_10 obj_30)
       (pred_10 obj_29)
       (pred_10 obj_07)
       (pred_10 obj_26)
       (pred_10 obj_17)
       (pred_10 obj_19)
       (pred_10 obj_05)
       (pred_10 obj_09)
       (pred_10 obj_13)
       (pred_10 obj_04)
       (pred_10 obj_22)
       (pred_10 obj_08)
       (pred_10 obj_23)
       (pred_10 obj_15)
       (pred_10 obj_20)
       (pred_10 obj_12)
       (pred_10 obj_14)
       (pred_10 obj_06)
       (pred_12 obj_27)
       (pred_12 obj_01)
       (pred_6 obj_16)
       (pred_6 obj_25)
       (pred_6 obj_21)

       (pred_3 obj_18 obj_11)
       (pred_3 obj_18 obj_03)
       (pred_3 obj_03 obj_02)
       (pred_3 obj_03 obj_24)
       (pred_3 obj_03 obj_18)
       (pred_3 obj_24 obj_30)
       (pred_3 obj_24 obj_28)
       (pred_3 obj_24 obj_03)
       (pred_3 obj_28 obj_29)
       (pred_3 obj_28 obj_10)
       (pred_3 obj_28 obj_24)
       (pred_3 obj_10 obj_07)
       (pred_3 obj_10 obj_28)
       (pred_3 obj_11 obj_26)
       (pred_3 obj_11 obj_02)
       (pred_3 obj_11 obj_18)
       (pred_3 obj_02 obj_17)
       (pred_3 obj_02 obj_30)
       (pred_3 obj_02 obj_03)
       (pred_3 obj_02 obj_11)
       (pred_3 obj_30 obj_19)
       (pred_3 obj_30 obj_29)
       (pred_3 obj_30 obj_24)
       (pred_3 obj_30 obj_02)
       (pred_3 obj_29 obj_05)
       (pred_3 obj_29 obj_07)
       (pred_3 obj_29 obj_28)
       (pred_3 obj_29 obj_30)
       (pred_3 obj_07 obj_09)
       (pred_3 obj_07 obj_10)
       (pred_3 obj_07 obj_29)
       (pred_3 obj_26 obj_13)
       (pred_3 obj_26 obj_17)
       (pred_3 obj_26 obj_11)
       (pred_3 obj_17 obj_04)
       (pred_3 obj_17 obj_19)
       (pred_3 obj_17 obj_02)
       (pred_3 obj_17 obj_26)
       (pred_3 obj_19 obj_22)
       (pred_3 obj_19 obj_05)
       (pred_3 obj_19 obj_30)
       (pred_3 obj_19 obj_17)
       (pred_3 obj_05 obj_08)
       (pred_3 obj_05 obj_09)
       (pred_3 obj_05 obj_29)
       (pred_3 obj_05 obj_19)
       (pred_3 obj_09 obj_23)
       (pred_3 obj_09 obj_07)
       (pred_3 obj_09 obj_05)
       (pred_3 obj_13 obj_15)
       (pred_3 obj_13 obj_04)
       (pred_3 obj_13 obj_26)
       (pred_3 obj_04 obj_20)
       (pred_3 obj_04 obj_22)
       (pred_3 obj_04 obj_17)
       (pred_3 obj_04 obj_13)
       (pred_3 obj_22 obj_12)
       (pred_3 obj_22 obj_08)
       (pred_3 obj_22 obj_19)
       (pred_3 obj_22 obj_04)
       (pred_3 obj_08 obj_14)
       (pred_3 obj_08 obj_23)
       (pred_3 obj_08 obj_05)
       (pred_3 obj_08 obj_22)
       (pred_3 obj_23 obj_06)
       (pred_3 obj_23 obj_09)
       (pred_3 obj_23 obj_08)
       (pred_3 obj_15 obj_20)
       (pred_3 obj_15 obj_13)
       (pred_3 obj_20 obj_12)
       (pred_3 obj_20 obj_04)
       (pred_3 obj_20 obj_15)
       (pred_3 obj_12 obj_14)
       (pred_3 obj_12 obj_22)
       (pred_3 obj_12 obj_20)
       (pred_3 obj_14 obj_06)
       (pred_3 obj_14 obj_08)
       (pred_3 obj_14 obj_12)
       (pred_3 obj_06 obj_23)
       (pred_3 obj_06 obj_14)
       (pred_2 obj_24)
       (pred_2 obj_02)
       (pred_2 obj_11)
       (pred_4  obj_24 obj_27)
       (pred_4  obj_02 obj_01)
       (pred_4  obj_11 obj_27)
       (pred_7 obj_18)
       (pred_7 obj_03)
       (pred_7 obj_28)
       (pred_7 obj_10)
       (pred_7 obj_30)
       (pred_7 obj_29)
       (pred_7 obj_07)
       (pred_7 obj_26)
       (pred_7 obj_17)
       (pred_7 obj_19)
       (pred_7 obj_05)
       (pred_7 obj_09)
       (pred_7 obj_13)
       (pred_7 obj_04)
       (pred_7 obj_22)
       (pred_7 obj_08)
       (pred_7 obj_23)
       (pred_7 obj_15)
       (pred_7 obj_20)
       (pred_7 obj_12)
       (pred_7 obj_14)
       (pred_7 obj_06)

       (pred_9  obj_16 obj_27)
       (pred_9  obj_25 obj_01)
       (pred_9  obj_21 obj_01)
       (pred_1 obj_16 obj_19)
       (pred_1 obj_25 obj_12)
       (pred_1 obj_21 obj_23)
       (pred_11 obj_20)
    )

    (:goal (and
       (pred_1 obj_25 obj_09)
    ))
(:constraints
  (always (not (pred_11 obj_22)))
)
)

; plan
1. (op_4 obj_20 obj_12)
   deleted: (pred_11 obj_20)
   added: (pred_11 obj_12)
   goals met: 0 of 1
2. (op_3 obj_12 obj_25)
   deleted: (pred_1 obj_25 obj_12) (pred_8)
   added: (pred_5 obj_25)
   goals met: 0 of 1
3. (op_4 obj_12 obj_14)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_14)
   goals met: 0 of 1
4. (op_4 obj_14 obj_08)
   deleted: (pred_11 obj_14)
   added: (pred_11 obj_08)
   goals met: 0 of 1
5. (op_4 obj_08 obj_05)
   deleted: (pred_11 obj_08)
   added: (pred_11 obj_05)
   goals met: 0 of 1
6. (op_4 obj_05 obj_09)
   deleted: (pred_11 obj_05)
   added: (pred_11 obj_09)
   goals met: 0 of 1
7. (op_2 obj_09 obj_25)
   deleted: (pred_5 obj_25)
   added: (pred_8) (pred_1 obj_25 obj_09)
   goals met: 1 of 1
